mengtrue/nRF52-24_Gzp/nRF52_ble_app_haptic/Keil/main.c
        case PM_EVT_PEER_DELETE_SUCCEEDED:
            break; // PM_EVT_PEER_DELETE_SUCCEEDED

        case PM_EVT_PEER_DELETE_FAILED:
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
            break; // PM_EVT_PEER_DELETE_FAILED

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start();
            break; // PM_EVT_PEERS_DELETE_SUCCEEDED

        case PM_EVT_PEERS_DELETE_FAILED:
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
            break; // PM_EVT_PEERS_DELETE_FAILED

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break; // PM_EVT_LOCAL_DB_CACHE_APPLIED

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
            break; // PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED

        case PM_EVT_SERVICE_CHANGED_IND_SENT:
            break; // PM_EVT_SERVICE_CHANGED_IND_SENT

        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
            break; // PM_EVT_SERVICE_CHANGED_IND_SENT

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one. */
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_PHONE);
       APP_ERROR_CHECK(err_code);*/

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}
	 
static void haptic_flag_handler(ble_haptic_t * p_haptic, uint8_t *p_data, uint16_t length)
{
	NRF_LOG_INFO("receive Flag data is %d, length = %d", p_data[0], length);
}

static void nRF52_ble_to_mcu_via_spi()
{
    uint8_t i = 0;
    for (i = 0; i < HAPTIC_RUMBLE_DATA_LENGTH; i++)
        m_tx_buf[i]++;
    //memset(m_tx_buf, 0, HAPTIC_RUMBLE_DATA_LENGTH);
	  memset(m_rx_buf, 0, HAPTIC_RUMBLE_DATA_LENGTH);
    //memcpy(m_tx_buf, haptic_rumble_value, HAPTIC_RUMBLE_DATA_LENGTH);
    //NRF_LOG_INFO("haptic value is %d, spi tx is %d\r\n", haptic_rumble_value[1], m_tx_buf[1]);
    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, HAPTIC_RUMBLE_DATA_LENGTH, m_rx_buf, HAPTIC_RUMBLE_DATA_LENGTH));
}

static void haptic_rumble_handler(ble_haptic_t * p_haptic, uint8_t * p_data, uint16_t length)
{
	NRF_LOG_INFO("receive Rumble data is %d\r\n", p_data[1]);
	/*NRF_LOG_HEXDUMP_INFO(p_data, strlen((const char *) p_data));
	NRF_LOG_INFO("\n");
	NRF_LOG_INFO("low : %x, high : %x \r\n", (uint8_t)p_data[0], (uint8_t)p_data[1]);
	uint16_t data = (p_data[1] << 8) | p_data[0];
	NRF_LOG_INFO("convert data : %d\r\n", (uint16_t)data);*/
	memcpy(haptic_rumble_value, p_data, HAPTIC_RUMBLE_DATA_LENGTH);

  nRF52_ble_to_mcu_via_spi();
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	  uint32_t                err_code;
	  ble_haptic_init_t          haptic_init;
	
	  memset(&haptic_init, 0, sizeof(haptic_init));
	  haptic_init.support_notification           = true;
	  haptic_init.haptic_flag_handler               = haptic_flag_handler;
	  haptic_init.haptic_rumble_handler             = haptic_rumble_handler;

    err_code = ble_haptic_init(&m_haptic, &haptic_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;
    NRF_LOG_DEBUG("on_conn_params_evt evt type is %d\r\n", p_evt->evt_type);

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = m_haptic.haptic_report_handles.cccd_handle;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

